NextFOAM-2506/tutorials/combustion/reactingFoam/RAS/membrane/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-2.5 -1.2 -3.0)
    ( 2.5 -1.2 -3.0)
    (-2.5  1.2 -3.0)
    ( 2.5  1.2 -3.0)

    (-2.5 -1.2  3.0)
    ( 2.5 -1.2  3.0)
    (-2.5  1.2  3.0)
    ( 2.5  1.2  3.0)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (50 24 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

mergePatchPairs
(
);


// ************************************************************************* //
